[
  {
    "title": "Camp Planner",
    "imageSrc": "projects/CampPlanner.jpg",
    "description": "A dynamic website for discovering and sharing unvisited campgrounds and tourist spots, allowing travel enthusiasts to add new locations, provide ratings, and write reviews. Enhanced with CRUD functionality, interactive cluster maps, precise location mapping, and image uploads to enrich the user experience.",
    "skills": ["Express", "NodeJs","MongoDB","EJS"],
    "demo": "https://campplanner.onrender.com/",
    "source": "https://github.com/TeekshaHarish/CampPlanner/tree/main"
  },
  {
    "title": "MedHelp",
    "imageSrc": "projects/MedHelp.jpg",
    "description": "A MERN stack-based healthcare platform that connects patients with healthcare providers through seamless appointment booking and advanced specialty search filters. Features include user and doctor registration, an admin dashboard for managing profiles, and machine learning-driven disease prediction and doctor recommendations.",
    "skills": ["React", "Express", "Node","MongoDB"],
    "demo": "",
    "source": "https://github.com/TeekshaHarish/DOC-APP"
  },
  {
    "title": "College Buddy",
    "imageSrc": "projects/CollegeBuddy.jpg",
    "description": "College Buddy is an innovative website designed to connect students seeking teammates for hackathons and projects with peers who possess complementary skill sets. It also serves as a centralized hub for discovering opportunities that students might otherwise overlook.",
    "skills": ["Express", "NodeJs","MongoDB","EJS"],
    "demo": "",
    "source": "https://github.com/TeekshaHarish/teammate-finder"
  },
  {
    "title": "GameZoneX",
    "imageSrc": "projects/GameZoneX.jpg",
    "description": "Mini Games Website comprising of games like Snake Game, Tic Tac Toe, Dino Game and a Card game. Features like play with computer or friend, and to choose diffulty are also added.",
    "skills": ["HTML", "CSS", "JS", "Bootstrap"],
    "demo": "https://gamezonex.onrender.com/",
    "source": "https://github.com/TeekshaHarish/GameZone"
  },
  {
    "title": "Physics Lab Website",
    "imageSrc": "projects/PhysicsLab.jpg",
    "description": "Its a website I made for my college's Physics Dpeartment.It serves as a central hub for students, faculty, and alumni, showcasing the latest in academic achievements and research breakthroughs. ",
    "skills": ["React","HTML","CSS","Bootstrap"],
    "demo": "https://physics-lab-website.vercel.app/",
    "source": "https://github.com/TeekshaHarish/Physics-Lab-Website"
  }
]
